run/DA0120/gasBase/constant/thermo.reactions
species
(
    air
    gas
);
reactions
{}
